Autodesk.Revit.DB.ATFTranslationServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFTranslationServiceData.DocumentToTranslate
Gets the document containing the data to be translated.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.ExportOptions
Export options used for translation to STL, OBJ, XML, SAT, or FDXJ file formats, or to FDX data exchange.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.OutputLocation
Gets the output path where the translated document should be saved, or a file URN of an FDX exchange.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData
This is a container for data which is passed from Revit to an instance of IATFTranslationServer.
Since:
2021